import json
from pathlib import Path
from typing import Optional, List, Dict, Any

from dotenv import load_dotenv
from langchain_community.graphs import Neo4jGraph

from fact_finder.evaluator.evaluation_sample import EvaluationSample
from fact_finder.tools.sub_graph_extractor import LLMSubGraphExtractor
from fact_finder.utils import build_neo4j_graph, load_chat_model


class EvalSampleAddition:
    """
    Class to add manually selected evaluation samples in our EvaluationSample format to a json file.
    TODO: the expected answers are rather random as of now. They may not correlate with whatever a LLM would verbalize
    """

    def __init__(self, graph: Neo4jGraph, subgraph_extractor: LLMSubGraphExtractor, path_to_json: Path):
        self._subgraph_extractor = subgraph_extractor
        self._graph = graph
        self._path_to_json = path_to_json

    def add_to_evaluation_sample_json(
        self,
        question: str,
        expected_cypher: str,
        source: str,
        expected_answer: str,
        nodes: Optional[List[Dict[str, Any]]] = None,
        is_answerable: Optional[bool] = True,
    ):

        subgraph_query = self._subgraph_extractor(expected_cypher)
        sub_graph = self._graph.query(query=subgraph_query)

        sample = EvaluationSample(
            question=question,
            cypher_query=expected_cypher,
            sub_graph=sub_graph,
            question_is_answerable=is_answerable,
            source=source,
            expected_answer=expected_answer,
            nodes=nodes,
        )
        self._persist(sample=sample)

    def _persist(self, sample: EvaluationSample):
        with open(self._path_to_json, "r", encoding="utf8") as r:
            json_content = json.load(r)
            evaluation_samples = [EvaluationSample.model_validate(x) for x in json_content]
        if sample.question not in [x.question for x in evaluation_samples]:
            evaluation_samples.append(sample)
        with open(self._path_to_json, "w", encoding="utf8") as w:
            json.dump([x.model_dump() for x in evaluation_samples], w, indent=4)


if __name__ == "__main__":
    load_dotenv()
    manual_samples = [
        {
            "question": "Which drugs have pterygium as side effect?",
            "expected_cypher": 'MATCH (n:drug)-[s:side_effect]-(g {name:"pterygium"}) RETURN distinct n',
            "expected_answer": "brinzolamide",
        },
        {
            "question": "Which medicine may cause pterygium?",
            "expected_cypher": 'MATCH (n:drug)-[s:side_effect]-(g {name:"pterygium"}) RETURN distinct n',
            "expected_answer": "brinzolamide",
        },
        {
            "question": "Which drugs have freckling as side effect?",
            "expected_cypher": 'MATCH (n:drug)-[s:side_effect]-(g {name:"freckling"}) RETURN distinct n',
            "expected_answer": "cytarabine, methoxsalen",
        },
        {
            "question": "Which medicine may cause freckling?",
            "expected_cypher": 'MATCH (n:drug)-[s:side_effect]-(g {name:"freckling"}) RETURN distinct n',
            "expected_answer": "cytarabine, methoxsalen",
        },
        {
            "question": "Which drugs are used to treat ocular hypertension?",
            "expected_cypher": 'MATCH (n:drug)-[r]-(d:disease {name:"ocular hypertension"}) RETURN n',
            "expected_answer": "108 drugs in total",
        },
        {
            "question": "Which drugs to treat ocular hypertension may cause the loss of eyelashes?",
            "expected_cypher": 'MATCH (n:drug)-[r]-(d:disease {name:"ocular hypertension"}) MATCH (n)-[s:side_effect]-(e:effect_or_phenotype {name:"loss of eyelashes"}) RETURN n',
            "expected_answer": "brinzolamide, bimatoprost, travoprost, paclitaxel, tobramycin",
        },
        {
            "question": "Which disease does not show in cleft upper lip?",
            "expected_cypher": 'MATCH (d)-[:phenotype_absent]-(p:effect_or_phenotype {name:"cleft upper lip"}) RETURN d',
            "expected_answer": "ectrodactyly-cleft palate syndrome",
        },
        {
            "question": "Which diseases show in symptoms such as eczema, neutropenia and a high forehead?",
            "expected_cypher": 'MATCH (d:disease)-[:phenotype_present]-({name:"eczema"}), MATCH (d)-[:phenotype_present]-({name:"neutropenia"}), MATCH (d)-[:phenotype_present]-({name:"high forehead"}), RETURN DISTINCT d.name',
            "expected_answer": "leigh syndrome, x-linked intellectual disability",
        },
        {
            "question": "Which expressions are present for the gene/protein f2?",
            "expected_cypher": 'MATCH (e:gene_or_protein {name:"f2"})-[ep:expression_present]-(a:anatomy) RETURN a.name',
            "expected_answer": "kidney, liver, fundus of stomach, stomach, multi-cellular organism, anatomical system, material anatomical entity, intestine, large intestine",
        },
        {
            "question": "Which drugs are associated with epilepsy?",
            "expected_cypher": 'MATCH (d:drug)-[:indication]->(dis:disease) WHERE dis.name = "epilepsy" RETURN d.name',
            "expected_answer": "The drugs associated with epilepsy are phenytoin, valproic acid, lamotrigine, diazepam, clonazepam, fosphenytoin, mephenytoin, neocitrullamon, carbamazepine, phenobarbital, secobarbital, primidone, and lorazepam.",
        },
        {
            "question": "In which Anatomical regions is IRAK4 expressed?",
            "expected_answer": "omental fat pad, cerebral cortex, adipose tissue of the abdominal region, layer, squamous epithelium, nasal cavity epithelium, mammary gland, oviduct, fallopian tube, oral cavity, esophagus, decidua, muscle, connective tissue, tonsil, bone marrow, thymus gland, adrenal gland, prostate gland, peritoneum, corpus callosum, spinal cord, subcutaneous adipose tissue, bronchus, cerebellar cortex, jejunum, duodenum, kidney, small intestine, liver, spleen, heart left ventricle, cardiac ventricle, cardiac atrium, lung, thyroid gland, substantia nigra, cerebellum, placenta, Ammon's horn, neocortex, hypothalamus, telencephalon, mesencephalon, forebrain, temporal lobe",
            "expected_cypher": 'MATCH (g:gene_or_protein {name: "irak4"})-[:expression_present]->(a:anatomy) RETURN a.name',
            "nodes": [
                {"index": 69864},
                {"index": 69442},
                {"index": 68729},
                {"index": 68618},
                {"index": 68316},
                {"index": 67302},
                {"index": 67143},
                {"index": 66826},
                {"index": 66050},
                {"index": 65990},
                {"index": 65557},
                {"index": 64894},
                {"index": 64876},
                {"index": 64814},
                {"index": 64813},
                {"index": 64801},
                {"index": 64800},
                {"index": 64799},
                {"index": 64798},
                {"index": 64796},
                {"index": 64787},
                {"index": 64766},
                {"index": 64675},
                {"index": 64626},
                {"index": 64621},
                {"index": 64565},
                {"index": 64553},
                {"index": 64552},
                {"index": 64551},
                {"index": 64546},
                {"index": 64545},
                {"index": 64544},
                {"index": 64523},
                {"index": 64521},
                {"index": 64520},
                {"index": 64487},
                {"index": 64485},
                {"index": 64477},
                {"index": 64476},
                {"index": 64470},
                {"index": 64427},
                {"index": 64416},
                {"index": 64395},
                {"index": 64391},
                {"index": 64352},
                {"index": 64339},
                {"index": 64334},
                {"index": 64332},
                {"index": 64331},
                {"index": 64312},
                {"index": 64311},
                {"index": 64269},
                {"index": 64267},
                {"index": 64253},
                {"index": 64065},
                {"index": 63830},
                {"index": 63772},
                {"index": 63745},
                {"index": 63744},
                {"index": 63713},
                {"index": 63704},
                {"index": 63684},
                {"index": 63674},
                {"index": 63609},
                {"index": 63604},
                {"index": 63603},
                {"index": 63602},
                {"index": 63584},
                {"index": 63501},
                {"index": 63500},
                {"index": 63481},
                {"index": 63466},
                {"index": 63465},
                {"index": 63464},
                {"index": 129374},
                {"index": 63431},
                {"index": 63430},
                {"index": 63426},
                {"index": 63425},
                {"index": 63423},
                {"index": 63377},
                {"index": 63376},
                {"index": 129373},
                {"index": 63372},
                {"index": 63370},
                {"index": 63359},
                {"index": 63273},
                {"index": 63240},
                {"index": 63223},
                {"index": 63181},
                {"index": 63164},
                {"index": 63148},
                {"index": 63136},
                {"index": 63123},
                {"index": 63117},
                {"index": 63116},
                {"index": 63112},
            ],
        },
        {
            "question": "What are the phenotypes associated with cardioacrofacial dysplasia?",
            "expected_answer": "mandibular prognathia, postaxial foot polydactyly, clinodactyly of the 5th finger, clubbing, hypodontia, left superior vena cava draining to coronary sinus, common atrium, recurrent patellar dislocation, postaxial hand polydactyly, narrow chest, broad forehead, prominent nasal tip, deep philtrum, tented upper lip vermilion, conical tooth, diastema, autosomal dominant inheritance, short philtrum, genu valgum, long thorax, atrioventricular canal defect, hypoplasia of the maxilla, postaxial polydactyly, accessory oral frenulum, overhanging nasal tip, midface retrusion, nail dysplasia, long face, complete atrioventricular canal defect, congenital onset, limb undergrowth",
            "expected_cypher": 'MATCH (d:disease {name: "cardioacrofacial dysplasia"})-[:phenotype_present]->(p:effect_or_phenotype) RETURN p.name',
            "nodes": [
                {"index": 84579},
                {"index": 24072},
                {"index": 24065},
                {"index": 26961},
                {"index": 84683},
                {"index": 88879},
                {"index": 88810},
                {"index": 86071},
                {"index": 24042},
                {"index": 84713},
                {"index": 84589},
                {"index": 86195},
                {"index": 85031},
                {"index": 88415},
                {"index": 25325},
                {"index": 24152},
                {"index": 22759},
                {"index": 84586},
                {"index": 26936},
                {"index": 93559},
                {"index": 22838},
                {"index": 23993},
                {"index": 22623},
                {"index": 84537},
                {"index": 88974},
                {"index": 88949},
                {"index": 22808},
                {"index": 84569},
                {"index": 84937},
                {"index": 85558},
                {"index": 23319},
            ],
        },
        {
            "question": "What are the symptoms of cardioacrofacial dysplasia?",
            "expected_answer": "mandibular prognathia, postaxial foot polydactyly, clinodactyly of the 5th finger, clubbing, hypodontia, left superior vena cava draining to coronary sinus, common atrium, recurrent patellar dislocation, postaxial hand polydactyly, narrow chest, broad forehead, prominent nasal tip, deep philtrum, tented upper lip vermilion, conical tooth, diastema, autosomal dominant inheritance, short philtrum, genu valgum, long thorax, atrioventricular canal defect, hypoplasia of the maxilla, postaxial polydactyly, accessory oral frenulum, overhanging nasal tip, midface retrusion, nail dysplasia, long face, complete atrioventricular canal defect, congenital onset, limb undergrowth",
            "expected_cypher": 'MATCH (d:disease {name: "cardioacrofacial dysplasia"})-[:phenotype_present]->(e:effect_or_phenotype) RETURN e.name',
            "nodes": [
                {"index": 84579},
                {"index": 24072},
                {"index": 24065},
                {"index": 26961},
                {"index": 84683},
                {"index": 88879},
                {"index": 88810},
                {"index": 86071},
                {"index": 24042},
                {"index": 84713},
                {"index": 84589},
                {"index": 86195},
                {"index": 85031},
                {"index": 88415},
                {"index": 25325},
                {"index": 24152},
                {"index": 22759},
                {"index": 84586},
                {"index": 26936},
                {"index": 93559},
                {"index": 22838},
                {"index": 23993},
                {"index": 22623},
                {"index": 84537},
                {"index": 88974},
                {"index": 88949},
                {"index": 22808},
                {"index": 84569},
                {"index": 84937},
                {"index": 85558},
                {"index": 23319},
            ],
        },
        {
            "question": "What pathways are involved in distal arthrogryposis?",
            "expected_answer": "The pathways involved in distal arthrogryposis are lgi-adam interactions, mitochondrial translation termination, alkbh3 mediated reversal of alkylation damage, prevention of phagosomal-lysosomal fusion, copi-independent golgi-to-er retrograde traffic, striated muscle contraction, platelet degranulation, smooth muscle contraction, striated muscle contraction, striated muscle contraction, striated muscle contraction, snrnp assembly, clathrin-mediated endocytosis, cargo recognition for clathrin-mediated endocytosis, acetylcholine neurotransmitter release cycle, rhov gtpase cycle, rhob gtpase cycle, rhoa gtpase cycle, striated muscle contraction, signal transduction by l1, interaction between l1 and ankyrins, recycling pathway of l1, l1cam interactions, basigin interactions, rna polymerase i transcription initiation, gap-filling dna repair synthesis and ligation in tc-ner, dual incision in tc-ner, transcription-coupled nucleotide excision repair (tc-ner), formation of tc-ner pre-incision complex, b-wich complex positively regulates rrna expression, ercc6 (csb) and ehmt2 (g9a) positively regulate rrna expression, eml4 and nudc in mitotic spindle formation, aggrephagy, hcmv early events, aurka activation by tpx2, mitotic prometaphase, copi-independent golgi-to-er retrograde traffic, copi-mediated anterograde transport, neutrophil degranulation, rho gtpases activate formins, anchoring of the basal body to the plasma membrane, recruitment of numa to mitotic centrosomes, loss of proteins required for interphase microtubule organization from the centrosome, recruitment of mitotic centrosome proteins and complexes, loss of nlp from mitotic centrosomes, hsp90 chaperone cycle for steroid hormone receptors (shr), regulation of plk1 activity at g2_or_m transition, resolution of sister chromatid cohesion, separation of sister chromatids, mhc class ii antigen presentation, amplification  of signal from unattached  kinetochores via a mad2  inhibitory signal, highly sodium permeable postsynaptic acetylcholine nicotinic receptors, potential therapeutics for sars, ion transport by p-type atpases, ion homeostasis, meiotic synapsis, lgi-adam interactions, mitochondrial translation termination, alkbh3 mediated reversal of alkylation damage, prevention of phagosomal-lysosomal fusion, copi-independent golgi-to-er retrograde traffic, striated muscle contraction, platelet degranulation, smooth muscle contraction, striated muscle contraction, striated muscle contraction, striated muscle contraction, snrnp assembly, clathrin-mediated endocytosis, cargo recognition for clathrin-mediated endocytosis, acetylcholine neurotransmitter release cycle, rhov gtpase cycle, rhob gtpase cycle, rhoa gtpase cycle, striated muscle contraction, signal transduction by l1, interaction between l1 and ankyrins, recycling pathway of l1, l1cam interactions, basigin interactions, rna polymerase i transcription initiation, gap-filling dna repair synthesis and ligation in tc-ner, dual incision in tc-ner, transcription-coupled nucleotide excision repair (tc-ner), formation of tc-ner pre-incision complex, b-wich complex positively regulates rrna expression, ercc6 (csb) and ehmt2 (g9a) positively regulate rrna expression, eml4 and nudc in mitotic spindle formation, aggrephagy, hcmv early events, aurka activation by tpx2, mitotic prometaphase, copi-independent golgi-to-er retrograde traffic, copi-mediated anterograde transport, neutrophil degranulation, rho gtpases activate formins, anchoring of the basal body to the plasma membrane, recruitment of numa to mitotic centrosomes, loss of proteins required for interphase microtubule organization from the centrosome, recruitment of mitotic centrosome proteins and complexes, loss of nlp from mitotic centrosomes, hsp90 chaperone cycle for steroid hormone receptors (shr), regulation of plk1 activity at g2_or_m transition, resolution of sister chromatid cohesion, separation of sister chromatids, mhc class ii antigen presentation, amplification  of signal from unattached  kinetochores via a mad2  inhibitory signal, highly sodium permeable postsynaptic acetylcholine nicotinic receptors, potential therapeutics for sars, ion transport by p-type atpases, and ion homeostasis.",
            "expected_cypher": 'MATCH (d:disease {name: "arthrogryposis"})-[:associated_with]->(gp:gene_or_protein)-[:interacts_with]->(p:pathway) RETURN p.name',
            "nodes": [
                {"index": 127690},
                {"index": 128542},
                {"index": 128960},
                {"index": 129230},
                {"index": 129022},
                {"index": 128385},
                {"index": 128990},
                {"index": 128386},
                {"index": 128385},
                {"index": 128385},
                {"index": 128385},
                {"index": 128013},
                {"index": 62931},
                {"index": 129023},
                {"index": 127635},
                {"index": 129149},
                {"index": 129137},
                {"index": 129136},
                {"index": 128385},
                {"index": 128293},
                {"index": 128292},
                {"index": 128291},
                {"index": 62655},
                {"index": 128076},
                {"index": 128939},
                {"index": 128812},
                {"index": 128811},
                {"index": 62828},
                {"index": 128810},
                {"index": 128529},
                {"index": 128528},
                {"index": 128866},
                {"index": 129262},
                {"index": 129209},
                {"index": 128887},
                {"index": 62845},
                {"index": 129022},
                {"index": 128052},
                {"index": 127886},
                {"index": 128023},
                {"index": 128623},
                {"index": 128865},
                {"index": 62664},
                {"index": 128338},
                {"index": 128337},
                {"index": 128156},
                {"index": 128884},
                {"index": 128863},
                {"index": 128867},
                {"index": 127696},
                {"index": 127721},
                {"index": 128807},
                {"index": 129310},
                {"index": 129370},
                {"index": 128559},
                {"index": 127779},
                {"index": 127690},
                {"index": 128542},
                {"index": 128960},
                {"index": 129230},
                {"index": 129022},
                {"index": 128385},
                {"index": 128990},
                {"index": 128386},
                {"index": 128385},
                {"index": 128385},
                {"index": 128385},
                {"index": 128013},
                {"index": 62931},
                {"index": 129023},
                {"index": 127635},
                {"index": 129149},
                {"index": 129137},
                {"index": 129136},
                {"index": 128385},
                {"index": 128293},
                {"index": 128292},
                {"index": 128291},
                {"index": 62655},
                {"index": 128076},
                {"index": 128939},
                {"index": 128812},
                {"index": 128811},
                {"index": 62828},
                {"index": 128810},
                {"index": 128529},
                {"index": 128528},
                {"index": 128866},
                {"index": 129262},
                {"index": 129209},
                {"index": 128887},
                {"index": 62845},
                {"index": 129022},
                {"index": 128052},
                {"index": 127886},
                {"index": 128023},
                {"index": 128623},
                {"index": 128865},
                {"index": 62664},
                {"index": 128338},
                {"index": 128337},
                {"index": 128156},
                {"index": 128884},
                {"index": 128863},
                {"index": 128867},
                {"index": 127696},
                {"index": 127721},
                {"index": 128807},
                {"index": 129310},
                {"index": 129370},
                {"index": 128559},
            ],
        },
        {
            "question": "What pathways are involved in Breast cancer?",
            "expected_answer": "The following pathways are involved in breast cancer: runx1 regulates expression of components of tight junctions,apoptotic cleavage of cell adhesion  proteins,trna modification in the nucleus and cytosol,transport of bile salts and organic acids, metal ions and amine compounds,antigen processing: ubiquitination & proteasome degradation,trna modification in the nucleus and cytosol,formation of the editosome,mrna editing: c to u conversion,rac1 gtpase cycle,post-translational modification: synthesis of gpi-anchored proteins,platelet degranulation,regulation of runx2 expression and activity,transcriptional activation of mitochondrial biogenesis,ppara activates gene expression,pyruvate metabolism,trna modification in the nucleus and cytosol,trna modification in the nucleus and cytosol,amyloid fiber formation,defective pyroptosis,inhibition of dna recombination at telomere,transcriptional regulation of granulopoiesis,hcmv late events,hcmv early events,meiotic recombination,estrogen-dependent gene expression,runx1 regulates transcription of genes involved in differentiation of hscs,runx1 regulates genes involved in megakaryocyte differentiation and platelet function,e3 ubiquitin ligases ubiquitinate target proteins,rna polymerase i promoter escape,rna polymerase i promoter opening,g2_or_m dna damage checkpoint,deposition of new cenpa-containing nucleosomes at the centromere,processing of dna double-strand break ends,nonhomologous end-joining (nhej),recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,ub-specific processing proteases,activated pkn1 stimulates transcription of ar (androgen receptor) regulated genes klk2 and klk3,activation of anterior hox genes in hindbrain development during early embryogenesis,transcriptional regulation by small rnas,dna methylation,b-wich complex positively regulates rrna expression,norc negatively regulates rrna expression,ercc6 (csb) and ehmt2 (g9a) positively regulate rrna expression,sirt1 negatively regulates rrna expression,hats acetylate histones,hdacs deacetylate histones,dna damage_or_telomere stress induced senescence,senescence-associated secretory phenotype (sasp),oxidative stress induced senescence,condensation of prophase chromosomes,prc2 methylates histones and dna,formation of the beta-catenin:tcf transactivating complex,pre-notch transcription and translation,packaging of telomere ends,meiotic synapsis,cleavage of the damaged purine,recognition and association of dna glycosylase with site containing an affected purine,cleavage of the damaged pyrimidine,recognition and association of dna glycosylase with site containing an affected pyrimidine,runx1 regulates transcription of genes involved in wnt signaling,regulation of fzd by ubiquitination,g2_or_m dna damage checkpoint,regulation of tp53 activity through phosphorylation,presynaptic phase of homologous dna pairing and strand exchange,processing of dna double-strand break ends,homologous dna pairing and strand exchange,resolution of d-loop structures through holliday junction intermediates,resolution of d-loop structures through synthesis-dependent strand annealing (sdsa),hdr through homologous recombination (hrr),hdr through single strand annealing (ssa),cytosolic iron-sulfur cluster assembly,macroautophagy,defective slc2a10 causes arterial tortuosity syndrome (ats),cellular hexose transport,transcriptional regulation of white adipocyte differentiation,ppara activates gene expression,homologous dna pairing and strand exchange,resolution of d-loop structures through holliday junction intermediates,resolution of d-loop structures through synthesis-dependent strand annealing (sdsa),hdr through homologous recombination (hrr),intraflagellar transport,hedgehog 'off' state,reversal of alkylation damage by dna dioxygenases,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,the role of gtse1 in g2_or_m progression after g2 checkpoint,trna modification in the nucleus and cytosol,regulation of fzd by ubiquitination,runx1 interacts with co-factors whose precise effect on runx1 targets is not known,rmts methylate histone arginines,o-linked glycosylation of mucins,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,mitochondrial protein import,antigen processing: ubiquitination & proteasome degradation,negative regulation of notch4 signaling,neddylation,regulation of runx2 expression and activity,association of tric_or_cct with target proteins during biosynthesis,constitutive signaling by notch1 hd+pest domain mutants,loss of function of fbxw7 in cancer and notch1 signaling,constitutive signaling by notch1 pest domain mutants,notch1 intracellular domain regulates transcription,runx1 interacts with co-factors whose precise effect on runx1 targets is not known,rmts methylate histone arginines,hats acetylate histones,notch4 activation and transmission of signal to the nucleus,notch3 activation and transmission of signal to the nucleus,notch2 activation and transmission of signal to the nucleus,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 hd domain mutants,constitutive signaling by notch1 t(7;9)(notch1:m1580_k2555) translocation mutant,constitutive signaling by notch1 pest domain mutants,activated notch1 transmits signal to the nucleus,activation of the tfap2 (ap-2) family of transcription factors,negative regulation of activity of tfap2 (ap-2) family transcription factors,nuclear signaling by erbb4,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,rho gtpases activate formins,signaling by robo receptors,generation of second messenger molecules,transcriptional regulation of granulopoiesis,runx3 regulates wnt signaling,transcriptional regulation by ventx,repression of wnt target genes,binding of tcf_or_lef:ctnnb1 to target gene promoters,ca2+ pathway,deactivation of the beta-catenin transactivating complex,formation of the beta-catenin:tcf transactivating complex,assembly of active lpl and lipc lipase complexes,transcriptional regulation of white adipocyte differentiation,ppara activates gene expression,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,runx1 regulates transcription of genes involved in wnt signaling,runx1 and foxp3 control the development of regulatory t lymphocytes (tregs),clathrin-mediated endocytosis,cargo recognition for clathrin-mediated endocytosis,pkmts methylate histone lysines,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,mecp2 regulates transcription of neuronal ligands,notch3 activation and transmission of signal to the nucleus,notch2 activation and transmission of signal to the nucleus,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 hd domain mutants,constitutive signaling by notch1 t(7;9)(notch1:m1580_k2555) translocation mutant,constitutive signaling by notch1 pest domain mutants,activated notch1 transmits signal to the nucleus,antigen processing: ubiquitination & proteasome degradation,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),regulation of expression of slits and robos,translation initiation complex formation,auf1 (hnrnp d0) binds and destabilizes mrna,deadenylation of mrna,l13a-mediated translational silencing of ceruloplasmin expression,notch3 intracellular domain regulates transcription,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 pest domain mutants,notch1 intracellular domain regulates transcription,serine biosynthesis,zinc influx into cells by the slc39 gene family,nectin_or_necl  trans heterodimerization,adherens junctions interactions,notch4 intracellular domain regulates transcription,notch3 intracellular domain regulates transcription,runx2 regulates osteoblast differentiation,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 pest domain mutants,notch1 intracellular domain regulates transcription,notch4 intracellular domain regulates transcription,notch3 intracellular domain regulates transcription,runx2 regulates osteoblast differentiation,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 pest domain mutants,notch1 intracellular domain regulates transcription,heme signaling,regulation of foxo transcriptional activity by acetylation,sirt1 negatively regulates rrna expression,circadian clock,regulation of hsf1-mediated heat shock response,neutrophil degranulation,meiotic synapsis,hdms demethylate histones,sensory processing of sound by outer hair cells of the cochlea,sensory processing of sound by inner hair cells of the cochlea,neurexins and neuroligins,cooperation of pdcl (phlp1) and tric_or_cct in g-protein beta folding,bbsome-mediated cargo-targeting to cilium,association of tric_or_cct with target proteins during biosynthesis,folding of actin by cct_or_tric,formation of tubulin folding intermediates by cct_or_tric,prefoldin mediated transfer of substrate  to cct_or_tric,signaling by lrp5 mutants,negative regulation of tcf-dependent signaling by wnt ligand antagonists,tcf dependent signaling in response to wnt,chk1_or_chk2(cds1) mediated inactivation of cyclin b:cdk1 complex,ubiquitin mediated degradation of phosphorylated cdc25a,stabilization of p53,g2_or_m dna damage checkpoint,regulation of tp53 activity through methylation,regulation of tp53 degradation,regulation of tp53 activity through phosphorylation,recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,rnd2 gtpase cycle,rnd3 gtpase cycle,rac1 gtpase cycle,butyrophilin (btn) family interactions,antigen processing: ubiquitination & proteasome degradation,aberrant regulation of mitotic exit in cancer due to rb1 defects,synthesis of active ubiquitin: roles of e1 and e2 enzymes,transcriptional regulation by ventx,cdk-mediated phosphorylation and removal of cdc6,senescence-associated secretory phenotype (sasp),separation of sister chromatids,apc-cdc20 mediated degradation of nek2a,phosphorylation of the apc_or_c,apc_or_c:cdc20 mediated degradation of mitotic proteins,regulation of apc_or_c activators between g1_or_s and early anaphase,conversion from apc_or_c:cdc20 to apc_or_c:cdh1 in late anaphase,cdc20:phospho-apc_or_c mediated degradation of cyclin a,apc_or_c:cdh1 mediated degradation of cdc20 and other apc_or_c:cdh1 targeted proteins in late mitosis_or_early g1,apc_or_c:cdc20 mediated degradation of securin,autodegradation of cdh1 by cdh1:apc_or_c,apc_or_c:cdc20 mediated degradation of cyclin b,inactivation of apc_or_c via direct inhibition of the apc_or_c complex,o-linked glycosylation,defective large causes mddga6 and mddgb6,keratan sulfate biosynthesis,interleukin-20 family signaling,neutrophil degranulation,hs-gag degradation,transport of organic anions,defective slco1b1 causes hyperbilirubinemia, rotor type (hblrr),heme degradation,recycling of bile acids and salts,amino acids regulate mtorc1,regulation of pten gene transcription,tp53 regulates metabolic genes,energy dependent regulation of mtor by lkb1-ampk,mtorc1-mediated signalling,mtor signalling,macroautophagy,neddylation,heme signaling,cytoprotection by hmox1,estrogen-dependent gene expression,activated pkn1 stimulates transcription of ar (androgen receptor) regulated genes klk2 and klk3,circadian clock,regulation of lipid metabolism by pparalpha,sumoylation of transcription cofactors,transcriptional regulation of white adipocyte differentiation,hats acetylate histones,activation of gene expression by srebf (srebp),transcriptional activation of mitochondrial biogenesis,endogenous sterols,ppara activates gene expression,synthesis of bile acids and bile salts via 27-hydroxycholesterol,synthesis of bile acids and bile salts via 7alpha-hydroxycholesterol,synthesis of bile acids and bile salts,recycling of bile acids and salts,bmal1:clock,npas2 activates circadian gene expression,rora activates gene expression,antagonism of activin by follistatin,ptk6 promotes hif1a stabilization,egr2 and sox10-mediated initiation of schwann cell myelination,runx3 regulates yap1-mediated transcription,runx2 regulates osteoblast differentiation,runx1 regulates transcription of genes involved in differentiation of hscs,yap1- and wwtr1 (taz)-stimulated gene expression,signaling by hippo,nuclear signaling by erbb4,tp53 regulates transcription of several additional cell death genes whose specific roles in p53-dependent apoptosis remain uncertain,kinesins,sealing of the nuclear envelope (ne) by escrt-iii,eml4 and nudc in mitotic spindle formation,aggrephagy,activation of ampk downstream of nmdars,assembly and cell surface presentation of nmda receptors,hcmv early events,carboxyterminal post-translational modifications of tubulin,the role of gtse1 in g2_or_m progression after g2 checkpoint,mitotic prometaphase,copi-independent golgi-to-er retrograde traffic,copi-dependent golgi-to-er retrograde traffic,copi-mediated anterograde transport,rho gtpases activate formins,rho gtpases activate iqgaps,intraflagellar transport,cilium assembly,hedgehog 'off' state,recycling pathway of l1,post-chaperonin tubulin folding pathway,formation of tubulin folding intermediates by cct_or_tric,prefoldin mediated transfer of substrate  to cct_or_tric,recruitment of numa to mitotic centrosomes,hsp90 chaperone cycle for steroid hormone receptors (shr),resolution of sister chromatid cohesion,separation of sister chromatids,mhc class ii antigen presentation,gap junction assembly,microtubule-dependent trafficking of connexons from golgi to the plasma membrane,translocation of slc2a4 (glut4) to the plasma membrane,ovarian tumor domain proteases,processing of capped intron-containing pre-mrna,mrna splicing - major pathway,activation of irf3_or_irf7 mediated by tbk1_or_ikk epsilon,traf6 mediated irf7 activation,ticam1-dependent activation of irf3_or_irf7,transcriptional regulation of white adipocyte differentiation,generic transcription pathway,ppara activates gene expression,rna polymerase ii transcription termination,mrna 3'-end processing,transport of mature mrna derived from an intron-containing transcript,macroautophagy,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,cdc42 gtpase cycle,rhob gtpase cycle,rhoa gtpase cycle,generic transcription pathway,heme signaling,cytoprotection by hmox1,nr1h2 & nr1h3 regulate gene expression to control bile acid homeostasis,hcmv early events,nr1h3 & nr1h2 regulate gene expression linked to cholesterol transport and efflux,regulation of mecp2 expression and activity,loss of mecp2 binding ability to the ncor_or_smrt complex,activation of anterior hox genes in hindbrain development during early embryogenesis,circadian clock,regulation of lipid metabolism by pparalpha,nuclear receptor transcription pathway,transcriptional regulation of white adipocyte differentiation,notch-hlh transcription pathway,hdacs deacetylate histones,constitutive signaling by notch1 hd+pest domain mutants,constitutive signaling by notch1 pest domain mutants,downregulation of smad2_or_3:smad4 transcriptional activity,transcriptional activation of mitochondrial biogenesis,notch1 intracellular domain regulates transcription,ppara activates gene expression,nr1d1 (rev-erba) represses gene expression,nuclear signaling by erbb4,rhof gtpase cycle,rhod gtpase cycle,formation of the editosome,mrna editing: c to u conversion,o-glycosylation of tsr domain-containing proteins,defective b3galtl causes peters-plus syndrome (pps),degradation of the extracellular matrix,iron uptake and transport,abacavir transmembrane transport,heme degradation,heme biosynthesis,clathrin-mediated endocytosis,cargo recognition for clathrin-mediated endocytosis,g2_or_m dna damage checkpoint,regulation of tp53 activity through phosphorylation,presynaptic phase of homologous dna pairing and strand exchange,processing of dna double-strand break ends,homologous dna pairing and strand exchange,resolution of d-loop structures through holliday junction intermediates,resolution of d-loop structures through synthesis-dependent strand annealing (sdsa),hdr through homologous recombination (hrr),hdr through single strand annealing (ssa),mismatch repair (mmr) directed by msh2:msh3 (mutsbeta),mismatch repair (mmr) directed by msh2:msh6 (mutsalpha),transport of nucleosides and free purine and pyrimidine bases across the plasma membrane,pyruvate metabolism,proton-coupled monocarboxylate transport,basigin interactions,tight junction interactions,rho gtpases activate cit,ret signaling,raf_or_map kinase cascade,ncam1 interactions,antigen processing: ubiquitination & proteasome degradation,g2_or_m dna damage checkpoint,processing of dna double-strand break ends,nonhomologous end-joining (nhej),recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,sumoylation of dna damage response and repair proteins,response of eif2ak1 (hri) to heme deficiency,response of eif2ak4 (gcn2) to amino acid deficiency,recycling of eif2:gdp,gtp hydrolysis and joining of the 60s ribosomal subunit,ribosomal scanning and start codon recognition,formation of the ternary complex, and subsequently, the 43s complex,translation initiation complex formation,abc-family proteins mediated transport,perk regulates gene expression,l13a-mediated translational silencing of ceruloplasmin expression,clathrin-mediated endocytosis,synthesis of pips at the plasma membrane,synthesis of ip2, ip, and ins in the cytosol,synthesis of pips at the early endosome membrane,synthesis of pips at the plasma membrane,trail  signaling,dimerization of procaspase-8,casp8 activity is inhibited,ripk1-mediated regulated necrosis,regulation by c-flip,caspase activation via death receptors in the presence of ligand,heme signaling,cytoprotection by hmox1,nr1h2 & nr1h3 regulate gene expression to control bile acid homeostasis,nr1h3 & nr1h2 regulate gene expression linked to cholesterol transport and efflux,estrogen-dependent gene expression,circadian clock,regulation of lipid metabolism by pparalpha,sumoylation of transcription cofactors,transcriptional regulation of white adipocyte differentiation,hats acetylate histones,activation of gene expression by srebf (srebp),transcriptional activation of mitochondrial biogenesis,endogenous sterols,ppara activates gene expression,synthesis of bile acids and bile salts via 27-hydroxycholesterol,synthesis of bile acids and bile salts via 7alpha-hydroxycholesterol,synthesis of bile acids and bile salts,recycling of bile acids and salts,bmal1:clock,npas2 activates circadian gene expression,rora activates gene expression,post-translational protein phosphorylation,regulation of insulin-like growth factor (igf) transport and uptake by insulin-like growth factor binding proteins (igfbps),hats acetylate histones,transcriptional regulation by runx2,amyloid fiber formation,defective pyroptosis,inhibition of dna recombination at telomere,transcriptional regulation of granulopoiesis,hcmv late events,hcmv early events,meiotic recombination,estrogen-dependent gene expression,runx1 regulates transcription of genes involved in differentiation of hscs,runx1 regulates genes involved in megakaryocyte differentiation and platelet function,e3 ubiquitin ligases ubiquitinate target proteins,rna polymerase i promoter escape,rna polymerase i promoter opening,g2_or_m dna damage checkpoint,deposition of new cenpa-containing nucleosomes at the centromere,processing of dna double-strand break ends,nonhomologous end-joining (nhej),recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,ub-specific processing proteases,activated pkn1 stimulates transcription of ar (androgen receptor) regulated genes klk2 and klk3,activation of anterior hox genes in hindbrain development during early embryogenesis,transcriptional regulation by small rnas,dna methylation,b-wich complex positively regulates rrna expression,norc negatively regulates rrna expression,ercc6 (csb) and ehmt2 (g9a) positively regulate rrna expression,sirt1 negatively regulates rrna expression,hats acetylate histones,hdacs deacetylate histones,dna damage_or_telomere stress induced senescence,senescence-associated secretory phenotype (sasp),oxidative stress induced senescence,condensation of prophase chromosomes,prc2 methylates histones and dna,formation of the beta-catenin:tcf transactivating complex,pre-notch transcription and translation,packaging of telomere ends,meiotic synapsis,cleavage of the damaged purine,recognition and association of dna glycosylase with site containing an affected purine,cleavage of the damaged pyrimidine,recognition and association of dna glycosylase with site containing an affected pyrimidine,recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,uch proteinases,runx1 interacts with co-factors whose precise effect on runx1 targets is not known,rmts methylate histone arginines,heme signaling,nr1h2 & nr1h3 regulate gene expression linked to gluconeogenesis,nr1h2 & nr1h3 regulate gene expression linked to lipogenesis,estrogen-dependent gene expression,circadian clock,sumoylation of transcription cofactors,estrogen-dependent gene expression,mapk6_or_mapk4 signaling,activation of anterior hox genes in hindbrain development during early embryogenesis,transcriptional regulation of white adipocyte differentiation,ppara activates gene expression,runx1 regulates genes involved in megakaryocyte differentiation and platelet function,activation of anterior hox genes in hindbrain development during early embryogenesis,deactivation of the beta-catenin transactivating complex,pkmts methylate histone lysines,formation of the beta-catenin:tcf transactivating complex,antigen processing: ubiquitination & proteasome degradation,inactivation of csf3 (g-csf) signaling,neddylation,downregulation of erbb2 signaling,vif-mediated degradation of apobec3g,transcriptional regulation of granulopoiesis,transcriptional regulation by the ap-2 (tfap2) family of transcription factors,b-wich complex positively regulates rrna expression,g alpha (i) signalling events,chemokine receptors bind chemokines,signaling by robo receptors,binding and entry of hiv virion,mitochondrial translation termination,mitochondrial translation elongation,mitochondrial translation initiation,homologous dna pairing and strand exchange,resolution of d-loop structures through holliday junction intermediates,resolution of d-loop structures through synthesis-dependent strand annealing (sdsa),hdr through homologous recombination (hrr),presynaptic phase of homologous dna pairing and strand exchange,homologous dna pairing and strand exchange,resolution of d-loop structures through holliday junction intermediates,resolution of d-loop structures through synthesis-dependent strand annealing (sdsa),hdr through homologous recombination (hrr),transcriptional regulation of testis differentiation,transcriptional regulation of white adipocyte differentiation,class b_or_2 (secretin family receptors),wnt ligand biogenesis and trafficking,g2_or_m dna damage checkpoint,processing of dna double-strand break ends,nonhomologous end-joining (nhej),recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,pkmts methylate histone lysines,aggrephagy,late endosomal microautophagy,chaperone mediated autophagy,rhobtb1 gtpase cycle,interleukin-4 and interleukin-13 signaling,striated muscle contraction,caspase-mediated cleavage of cytoskeletal proteins,vegf binds to vegfr leading to receptor dimerization,vegf ligand-receptor interactions,platelet degranulation,vegf binds to vegfr leading to receptor dimerization,vegf ligand-receptor interactions,platelet degranulation,sumoylation of intracellular receptors,nuclear receptor transcription pathway,vitamin d (calciferol) metabolism,pyrimidine biosynthesis,g1_or_s-specific transcription,interconversion of nucleotide di- and triphosphates,purinergic signaling in leishmaniasis infection,regulation of foxo transcriptional activity by acetylation,the nlrp3 inflammasome,protein repair,tp53 regulates metabolic genes,interconversion of nucleotide di- and triphosphates,detoxification of reactive oxygen species,oxidative stress induced senescence,runx1 regulates transcription of genes involved in differentiation of hscs,regulation of tp53 activity through association with co-factors,tp53 regulates transcription of death receptors and ligands,tp53 regulates transcription of caspase activators and caspases,tp53 regulates transcription of several additional cell death genes whose specific roles in p53-dependent apoptosis remain uncertain,tp53 regulates transcription of genes involved in cytochrome c release,activation of puma and translocation to mitochondria,regulation of tp53 activity through association with co-factors,tp53 regulates transcription of death receptors and ligands,tp53 regulates transcription of several additional cell death genes whose specific roles in p53-dependent apoptosis remain uncertain,tp53 regulates transcription of genes involved in cytochrome c release,activation of puma and translocation to mitochondria,g2_or_m dna damage checkpoint,processing of dna double-strand break ends,nonhomologous end-joining (nhej),recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,sumoylation of transcription factors,factors involved in megakaryocyte development and platelet production,regulation of pten gene transcription,runx3 regulates cdkn1a transcription,transcriptional regulation by ventx,the role of gtse1 in g2_or_m progression after g2 checkpoint,transcriptional  activation of  cell cycle inhibitor p21,stabilization of p53,g2_or_m checkpoints,g2_or_m dna damage checkpoint,pi5p regulates tp53 acetylation,regulation of tp53 activity through methylation,regulation of tp53 activity through association with co-factors,regulation of tp53 activity through acetylation,regulation of tp53 degradation,regulation of tp53 activity through phosphorylation,regulation of tp53 expression,tp53 regulates transcription of genes involved in g1 cell cycle arrest,tp53 regulates transcription of additional cell cycle genes whose exact role in the p53 pathway remain uncertain,tp53 regulates transcription of genes involved in g2 cell cycle arrest,tp53 regulates transcription of death receptors and ligands,tp53 regulates transcription of caspase activators and caspases,tp53 regulates transcription of several additional cell death genes whose specific roles in p53-dependent apoptosis remain uncertain,tp53 regulates transcription of genes involved in cytochrome c release,tp53 regulates transcription of dna repair genes,interleukin-4 and interleukin-13 signaling,recruitment and atm-mediated phosphorylation of repair and signaling proteins at dna double strand breaks,ovarian tumor domain proteases,ub-specific processing proteases,tp53 regulates metabolic genes,pyroptosis,association of tric_or_cct with target proteins during biosynthesis,autodegradation of the e3 ubiquitin ligase cop1,sumoylation of transcription factors,dna damage_or_telomere stress induced senescence,oncogene induced senescence,formation of senescence-associated heterochromatin foci (sahf),oxidative stress induced senescence,pre-notch transcription and translation,activation of puma and translocation to mitochondria,activation of noxa and translocation to mitochondria,sumoylation of dna replication proteins,transcription of e2f targets under negative control by dream complex,tnf signaling,interleukin-4 and interleukin-13 signaling,interleukin-10 signaling,tnfr2 non-canonical nf-kb pathway,tnfr1-mediated ceramide production,tnfr1-induced nfkappab signaling pathway,regulation of tnfr1 signaling,tnfr1-induced proapoptotic signaling,transcriptional regulation of white adipocyte differentiation,estrogen-dependent gene expression,repression of wnt target genes,deactivation of the beta-catenin transactivating complex,notch1 intracellular domain regulates transcription,formation of the beta-catenin:tcf transactivating complex,integrin cell surface interactions,immunoregulatory interactions between a lymphoid and a non-lymphoid cell,runx1 regulates genes involved in megakaryocyte differentiation and platelet function,o-glycosylation of tsr domain-containing proteins,defective b3galtl causes peters-plus syndrome (pps),syndecan interactions,integrin cell surface interactions,signaling by pdgf,platelet degranulation,rnd1 gtpase cycle,rnd2 gtpase cycle,transferrin endocytosis and recycling,rac3 gtpase cycle,rhoj gtpase cycle,rhog gtpase cycle,rhoh gtpase cycle,rhoq gtpase cycle,rac2 gtpase cycle,rac1 gtpase cycle,cdc42 gtpase cycle,rhoc gtpase cycle,rhob gtpase cycle,rhoa gtpase cycle,clathrin-mediated endocytosis,cargo recognition for clathrin-mediated endocytosis,golgi associated vesicle biogenesis,nuclear receptor transcription pathway,tfap2a acts as a transcriptional repressor during retinoic acid induced cell differentiation,tfap2 (ap-2) family regulates transcription of cell cycle factors,tfap2 (ap-2) family regulates transcription of growth factors and their receptors,activation of the tfap2 (ap-2) family of transcription factors,tfap2 (ap-2) family regulates transcription of other transcription factors,negative regulation of activity of tfap2 (ap-2) family transcription factors,transcriptional regulation by the ap-2 (tfap2) family of transcription factors,sumoylation of transcription factors,formation of the beta-catenin:tcf transactivating complex,telomere extension by telomerase,interleukin-4 and interleukin-13 signaling,cytosolic sulfonation of small molecules,interaction between phlda1 and aurka,aurka activation by tpx2,fbxl7 down-regulates aurka during mitotic entry and in early mitosis,regulation of tp53 activity through phosphorylation,tp53 regulates transcription of genes involved in g2 cell cycle arrest,sumoylation of dna replication proteins,regulation of plk1 activity at g2_or_m transition,apc_or_c:cdh1 mediated degradation of cdc20 and other apc_or_c:cdh1 targeted proteins in late mitosis_or_early g1,growth hormone receptor signaling,inactivation of csf3 (g-csf) signaling,signaling by flt3 fusion proteins,stat5 activation downstream of flt3 itd mutants,signaling by csf3 (g-csf),signaling by phosphorylated juxtamembrane, extracellular and kinase domain kit mutants,stat5 activation,erythropoietin activates stat5,interleukin-21 signaling,interleukin-2 signaling,interleukin-9 signaling,interleukin-15 signaling,interleukin-20 family signaling,interleukin-3, interleukin-5 and gm-csf signaling,signaling by leptin,downstream signal transduction,signaling by cytosolic fgfr1 fusion mutants,signaling by scf-kit,interleukin-7 signaling,nuclear signaling by erbb4,prolactin receptor signaling,growth hormone receptor signaling,cytoprotection by hmox1,inactivation of csf3 (g-csf) signaling,signaling by csf3 (g-csf),signaling by pdgfra extracellular domain mutants,signaling by pdgfra transmembrane, juxtamembrane and kinase domain mutants,signaling by phosphorylated juxtamembrane, extracellular and kinase domain kit mutants,transcriptional regulation of granulopoiesis,interleukin-21 signaling,interleukin-27 signaling,interleukin-23 signaling,interleukin-37 signaling,interleukin-9 signaling,interleukin-35 signalling,interleukin-15 signaling,met activates stat3,interleukin-20 family signaling,ptk6 activates stat3,interleukin-4 and interleukin-13 signaling,interleukin-10 signaling,transcriptional regulation of pluripotent stem cells,association of tric_or_cct with target proteins during biosynthesis,pou5f1 (oct4), sox2, nanog activate genes related to proliferation,signaling by leptin,senescence-associated secretory phenotype (sasp),signalling to stat3,downstream signal transduction,signaling by cytosolic fgfr1 fusion mutants,signaling by scf-kit,interleukin-7 signaling,bh3-only proteins associate with and inactivate anti-apoptotic bcl-2 members,interleukin-6 signaling,egr2 and sox10-mediated initiation of schwann cell myelination,transcriptional regulation of white adipocyte differentiation,activation of gene expression by srebf (srebp),ppara activates gene expression,regulation of cholesterol biosynthesis by srebp (srebf),signaling by phosphorylated juxtamembrane, extracellular and kinase domain kit mutants,fcgr3a-mediated phagocytosis,fcgr3a-mediated il10 synthesis,signaling by raf1 mutants,signaling downstream of ras mutants,long-term potentiation,activated ntrk3 signals through pi3k,activated ntrk2 signals through fyn,extra-nuclear estrogen signaling,regulation of runx3 expression and activity,runx2 regulates osteoblast differentiation,receptor mediated mitophagy,regulation of runx1 expression and activity,inla-mediated entry of listeria monocytogenes into host cells,met activates ptk2 signaling,ret signaling,cyclin d associated events in g1,pi5p, pp2a and ier3 regulate pi3k_or_akt signaling,paradoxical activation of raf signaling by kinase inactive braf,signaling by braf and raf fusions,signaling by high-kinase activity braf mutants,signaling by moderate kinase activity braf mutants,map2k and mapk activation,raf activation,rho gtpases activate formins,clec7a (dectin-1) signaling,vegfr2 mediated cell proliferation,thrombin signalling through proteinase activated receptors (pars),vegfa-vegfr2 pathway,recycling pathway of l1,gp1b-ix-v activation signalling,regulation of commissural axon pathfinding by slit and robo,netrin mediated repulsion signals,dcc mediated attractive signaling,g alpha (i) signalling events,adp signalling through p2y purinoceptor 1,g alpha (s) signalling events,eph-ephrin mediated repulsion of cells,ephrin signaling,epha-mediated growth cone collapse,ephb-mediated forward signaling,signal regulatory protein family interactions,ctla4 inhibitory signaling,cd28 co-stimulation,ncam signaling for neurite out-growth,p130cas linkage to mapk signaling for integrins,grb2:sos provides linkage to mapk signaling for integrins,integrin signaling,eph-ephrin signaling,constitutive signaling by aberrant pi3k in cancer,pecam1 interactions,fcgr activation,regulation of gap junction activity,downstream signal transduction,gab1 signalosome,signaling by egfr,p38mapk events,regulation of kit signaling,signaling by scf-kit,spry regulation of fgf signaling,pip3 activates akt signaling,downregulation of erbb4 signaling,nuclear signaling by erbb4,signaling by erbb2,post-translational protein phosphorylation,runx3 regulates immune response and cell migration,regulation of insulin-like growth factor (igf) transport and uptake by insulin-like growth factor binding proteins (igfbps),integrin cell surface interactions,signaling by pdgf,degradation of the extracellular matrix,foxo-mediated transcription of oxidative stress, metabolic and neuronal genes,gene and protein expression by jak-stat signaling after interleukin-12 stimulation,deregulated cdk5 triggers multiple neurodegenerative pathways in alzheimer's disease models,detoxification of reactive oxygen species,transcriptional activation of mitochondrial biogenesis,regulation of pten gene transcription,runx1 interacts with co-factors whose precise effect on runx1 targets is not known,rmts methylate histone arginines,regulation of pten gene transcription,defective slc5a5 causes thyroid dyshormonogenesis 1 (tdh1),organic anion transporters,thyroxine biosynthesis,intestinal hexose absorption,neutrophil degranulation,intestinal hexose absorption,defective slc2a2 causes fanconi-bickel syndrome (fbs),regulation of insulin secretion,regulation of gene expression in beta cells,cellular hexose transport,lactose synthesis,defective slc2a1 causes glut1 deficiency syndrome 1 (glut1ds1),regulation of insulin secretion,vitamin c (ascorbate) metabolism,cellular hexose transport,carnitine synthesis,metabolism of folate and pterines,negative regulation of tcf-dependent signaling by wnt ligand antagonists,tcf dependent signaling in response to wnt,negative regulation of tcf-dependent signaling by wnt ligand antagonists,tcf dependent signaling in response to wnt,map3k8 (tpl2)-dependent mapk1_or_3 activation,uptake and function of anthrax toxins,jnk (c-jun kinases) phosphorylation and  activation mediated by activated human tak1,fceri mediated mapk activation,oxidative stress induced senescence,estrogen-dependent gene expression,g alpha (i) signalling events,chemokine receptors bind chemokines,signaling by robo receptors,nuclear signaling by erbb4,interleukin-10 signaling,g alpha (i) signalling events,chemokine receptors bind chemokines,nr1h2 & nr1h3 regulate gene expression linked to gluconeogenesis,nr1h2 & nr1h3 regulate gene expression to control bile acid homeostasis,nr1h2 & nr1h3 regulate gene expression linked to triglyceride lipolysis in adipose,nr1h2 & nr1h3 regulate gene expression to limit cholesterol uptake,nr1h3 & nr1h2 regulate gene expression linked to cholesterol transport and efflux,nr1h2 & nr1h3 regulate gene expression linked to lipogenesis,signaling by retinoic acid,nuclear receptor transcription pathway,ppara activates gene expression,ngf-stimulated transcription,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,ribosomal scanning and start codon recognition,formation of the ternary complex, and subsequently, the 43s complex,formation of a pool of free 40s subunits,translation initiation complex formation,major pathway of rrna processing in the nucleolus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,ribosomal scanning and start codon recognition,formation of the ternary complex, and subsequently, the 43s complex,formation of a pool of free 40s subunits,translation initiation complex formation,major pathway of rrna processing in the nucleolus and cytosol,rrna modification in the nucleus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,constitutive signaling by akt1 e17k in cancer,akt phosphorylates targets in the nucleus,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,ribosomal scanning and start codon recognition,formation of the ternary complex, and subsequently, the 43s complex,formation of a pool of free 40s subunits,translation initiation complex formation,major pathway of rrna processing in the nucleolus and cytosol,rrna modification in the nucleus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,mtorc1-mediated signalling,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,ribosomal scanning and start codon recognition,formation of the ternary complex, and subsequently, the 43s complex,formation of a pool of free 40s subunits,translation initiation complex formation,major pathway of rrna processing in the nucleolus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,formation of a pool of free 40s subunits,major pathway of rrna processing in the nucleolus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,formation of a pool of free 40s subunits,major pathway of rrna processing in the nucleolus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,nonsense mediated decay (nmd) enhanced by the exon junction complex (ejc),nonsense mediated decay (nmd) independent of the exon junction complex (ejc),response of eif2ak4 (gcn2) to amino acid deficiency,regulation of expression of slits and robos,eukaryotic translation termination,gtp hydrolysis and joining of the 60s ribosomal subunit,formation of a pool of free 40s subunits,major pathway of rrna processing in the nucleolus and cytosol,selenocysteine synthesis,viral mrna translation,srp-dependent cotranslational protein targeting to membrane,peptide chain elongation,l13a-mediated translational silencing of ceruloplasmin expression,g alpha (q) signalling events,purinergic signaling in leishmaniasis infection,traf6 mediated nf-kb activation,interleukin-1 signaling,transcriptional regulation by ventx,the nlrp3 inflammasome,clec7a_or_inflammasome pathway,cd209 (dc-sign) signaling,clec7a (dectin-1) signaling,dectin-1 mediated noncanonical nf-kb signaling,ikba variant leads to eda-id,sumoylation of immune response proteins,interleukin-1 processing,tak1 activates nfkb by phosphorylation and activation of ikks complex,transcriptional regulation of white adipocyte differentiation,pkmts methylate histone lysines,dex_or_h-box helicases activate type i ifn and inflammatory cytokines production,fceri mediated nf-kb activation,senescence-associated secretory phenotype (sasp),nf-kb is activated and signals survival,downstream tcr signaling,regulated proteolysis of p75ntr,rip-mediated nfkb activation via zbp1,activation of nf-kappab in b cells,replication of the sars-cov-2 genome,aberrant regulation of mitotic exit in cancer due to rb1 defects,replication of the sars-cov-1 genome,defective translocation of rb1 mutants to the nucleus,defective binding of rb1 mutants to e2f1,(e2f2, e2f3),runx2 regulates osteoblast differentiation.",
            "expected_cypher": 'MATCH (d:disease {name: "breast carcinoma"})-[:associated_with]->(gp:gene_or_protein)-[:interacts_with]->(p:pathway) RETURN p.name',
            "nodes": [
                {"index": 129055},
                {"index": 127617},
                {"index": 62829},
                {"index": 62707},
                {"index": 129365},
                {"index": 62829},
                {"index": 128923},
                {"index": 62883},
                {"index": 129140},
                {"index": 62445},
                {"index": 128990},
                {"index": 129049},
                {"index": 127797},
                {"index": 128393},
                {"index": 62876},
                {"index": 62829},
                {"index": 62829},
                {"index": 128381},
                {"index": 129238},
                {"index": 127794},
                {"index": 127691},
                {"index": 129210},
                {"index": 129209},
                {"index": 127780},
                {"index": 129069},
                {"index": 129057},
                {"index": 129056},
                {"index": 129020},
                {"index": 128940},
                {"index": 128938},
                {"index": 62865},
                {"index": 129006},
                {"index": 128789},
                {"index": 128784},
                {"index": 128792},
                {"index": 128781},
                {"index": 128716},
                {"index": 128709},
                {"index": 128096},
                {"index": 128113},
                {"index": 128529},
                {"index": 128531},
                {"index": 128528},
                {"index": 128530},
                {"index": 128226},
                {"index": 128223},
                {"index": 62615},
                {"index": 128176},
                {"index": 128175},
                {"index": 128861},
                {"index": 128111},
                {"index": 62571},
                {"index": 127995},
                {"index": 127793},
                {"index": 127779},
                {"index": 128952},
                {"index": 128951},
                {"index": 128954},
                {"index": 128953},
                {"index": 129063},
                {"index": 128063},
                {"index": 62865},
                {"index": 128720},
                {"index": 128790},
                {"index": 128789},
                {"index": 62819},
                {"index": 128786},
                {"index": 128785},
                {"index": 62812},
                {"index": 128788},
                {"index": 127723},
                {"index": 62448},
                {"index": 128666},
                {"index": 128438},
                {"index": 127688},
                {"index": 128393},
                {"index": 62819},
                {"index": 128786},
                {"index": 128785},
                {"index": 62812},
                {"index": 128624},
                {"index": 62770},
                {"index": 62905},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 128885},
                {"index": 62829},
                {"index": 128063},
                {"index": 129059},
                {"index": 128227},
                {"index": 62998},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 129206},
                {"index": 129365},
                {"index": 129157},
                {"index": 128799},
                {"index": 129049},
                {"index": 128360},
                {"index": 128188},
                {"index": 128180},
                {"index": 128179},
                {"index": 128041},
                {"index": 129059},
                {"index": 128227},
                {"index": 128226},
                {"index": 129156},
                {"index": 62980},
                {"index": 128044},
                {"index": 128188},
                {"index": 128187},
                {"index": 128181},
                {"index": 128179},
                {"index": 128042},
                {"index": 129028},
                {"index": 129026},
                {"index": 127680},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 128023},
                {"index": 62659},
                {"index": 128074},
                {"index": 127691},
                {"index": 129044},
                {"index": 128117},
                {"index": 128015},
                {"index": 128065},
                {"index": 128348},
                {"index": 128058},
                {"index": 62571},
                {"index": 129090},
                {"index": 127688},
                {"index": 128393},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 129063},
                {"index": 129052},
                {"index": 62931},
                {"index": 129023},
                {"index": 128224},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 129109},
                {"index": 62980},
                {"index": 128044},
                {"index": 128188},
                {"index": 128187},
                {"index": 128181},
                {"index": 128179},
                {"index": 128042},
                {"index": 129365},
                {"index": 129194},
                {"index": 129193},
                {"index": 128315},
                {"index": 128930},
                {"index": 128490},
                {"index": 128442},
                {"index": 128929},
                {"index": 129135},
                {"index": 128188},
                {"index": 128179},
                {"index": 128041},
                {"index": 128913},
                {"index": 128446},
                {"index": 128412},
                {"index": 62703},
                {"index": 129155},
                {"index": 129135},
                {"index": 129070},
                {"index": 128188},
                {"index": 128179},
                {"index": 128041},
                {"index": 129155},
                {"index": 129135},
                {"index": 129070},
                {"index": 128188},
                {"index": 128179},
                {"index": 128041},
                {"index": 128158},
                {"index": 129216},
                {"index": 128530},
                {"index": 62692},
                {"index": 128247},
                {"index": 127886},
                {"index": 127779},
                {"index": 128225},
                {"index": 63024},
                {"index": 129246},
                {"index": 128824},
                {"index": 128361},
                {"index": 128711},
                {"index": 128360},
                {"index": 128359},
                {"index": 128358},
                {"index": 128357},
                {"index": 128507},
                {"index": 128059},
                {"index": 62570},
                {"index": 128889},
                {"index": 128894},
                {"index": 62867},
                {"index": 62865},
                {"index": 128722},
                {"index": 128842},
                {"index": 128720},
                {"index": 128792},
                {"index": 129152},
                {"index": 129151},
                {"index": 129140},
                {"index": 127698},
                {"index": 129365},
                {"index": 129321},
                {"index": 129019},
                {"index": 128117},
                {"index": 128871},
                {"index": 128176},
                {"index": 128867},
                {"index": 127954},
                {"index": 127943},
                {"index": 62514},
                {"index": 62512},
                {"index": 127931},
                {"index": 127953},
                {"index": 127930},
                {"index": 127942},
                {"index": 127929},
                {"index": 127941},
                {"index": 127720},
                {"index": 62745},
                {"index": 128363},
                {"index": 127839},
                {"index": 128484},
                {"index": 127886},
                {"index": 127843},
                {"index": 128437},
                {"index": 128693},
                {"index": 127981},
                {"index": 128010},
                {"index": 129354},
                {"index": 128852},
                {"index": 128274},
                {"index": 127855},
                {"index": 127854},
                {"index": 62460},
                {"index": 62448},
                {"index": 128799},
                {"index": 128158},
                {"index": 63064},
                {"index": 129069},
                {"index": 128716},
                {"index": 62692},
                {"index": 62691},
                {"index": 128202},
                {"index": 127688},
                {"index": 128226},
                {"index": 127856},
                {"index": 127797},
                {"index": 62588},
                {"index": 128393},
                {"index": 128001},
                {"index": 127999},
                {"index": 62543},
                {"index": 128010},
                {"index": 128396},
                {"index": 128395},
                {"index": 127783},
                {"index": 129016},
                {"index": 129303},
                {"index": 129045},
                {"index": 129070},
                {"index": 129057},
                {"index": 128114},
                {"index": 127814},
                {"index": 127680},
                {"index": 128724},
                {"index": 129367},
                {"index": 128197},
                {"index": 128866},
                {"index": 129262},
                {"index": 128450},
                {"index": 128457},
                {"index": 129209},
                {"index": 128800},
                {"index": 128885},
                {"index": 62845},
                {"index": 129022},
                {"index": 129021},
                {"index": 128052},
                {"index": 128023},
                {"index": 128018},
                {"index": 128624},
                {"index": 62771},
                {"index": 62770},
                {"index": 128291},
                {"index": 128374},
                {"index": 128358},
                {"index": 128357},
                {"index": 128865},
                {"index": 128156},
                {"index": 128863},
                {"index": 128867},
                {"index": 127696},
                {"index": 62538},
                {"index": 127992},
                {"index": 128053},
                {"index": 128782},
                {"index": 62885},
                {"index": 128921},
                {"index": 129196},
                {"index": 127920},
                {"index": 127884},
                {"index": 127688},
                {"index": 62504},
                {"index": 128393},
                {"index": 128944},
                {"index": 128925},
                {"index": 128924},
                {"index": 62448},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 129139},
                {"index": 129137},
                {"index": 129136},
                {"index": 62504},
                {"index": 128158},
                {"index": 63064},
                {"index": 129172},
                {"index": 129209},
                {"index": 129169},
                {"index": 129107},
                {"index": 129114},
                {"index": 128709},
                {"index": 62692},
                {"index": 62691},
                {"index": 128116},
                {"index": 127688},
                {"index": 128115},
                {"index": 128223},
                {"index": 128188},
                {"index": 128179},
                {"index": 128138},
                {"index": 127797},
                {"index": 128041},
                {"index": 128393},
                {"index": 128394},
                {"index": 127680},
                {"index": 129150},
                {"index": 129142},
                {"index": 128923},
                {"index": 62883},
                {"index": 128523},
                {"index": 128369},
                {"index": 62404},
                {"index": 62999},
                {"index": 128129},
                {"index": 127981},
                {"index": 127980},
                {"index": 62931},
                {"index": 129023},
                {"index": 62865},
                {"index": 128720},
                {"index": 128790},
                {"index": 128789},
                {"index": 62819},
                {"index": 128786},
                {"index": 128785},
                {"index": 62812},
                {"index": 128788},
                {"index": 128538},
                {"index": 128537},
                {"index": 128436},
                {"index": 62876},
                {"index": 128422},
                {"index": 128076},
                {"index": 128414},
                {"index": 128016},
                {"index": 128418},
                {"index": 62807},
                {"index": 128297},
                {"index": 129365},
                {"index": 62865},
                {"index": 128789},
                {"index": 128784},
                {"index": 128792},
                {"index": 128199},
                {"index": 128157},
                {"index": 129353},
                {"index": 128935},
                {"index": 128934},
                {"index": 128933},
                {"index": 128932},
                {"index": 128930},
                {"index": 62672},
                {"index": 62668},
                {"index": 128929},
                {"index": 62931},
                {"index": 127768},
                {"index": 127758},
                {"index": 127773},
                {"index": 127768},
                {"index": 128948},
                {"index": 127716},
                {"index": 128770},
                {"index": 62747},
                {"index": 127715},
                {"index": 62394},
                {"index": 128158},
                {"index": 63064},
                {"index": 129172},
                {"index": 129169},
                {"index": 129069},
                {"index": 62692},
                {"index": 62691},
                {"index": 128202},
                {"index": 127688},
                {"index": 128226},
                {"index": 127856},
                {"index": 127797},
                {"index": 62588},
                {"index": 128393},
                {"index": 128001},
                {"index": 127999},
                {"index": 62543},
                {"index": 128010},
                {"index": 128396},
                {"index": 128395},
                {"index": 128801},
                {"index": 128378},
                {"index": 128226},
                {"index": 62940},
                {"index": 128381},
                {"index": 129238},
                {"index": 127794},
                {"index": 127691},
                {"index": 129210},
                {"index": 129209},
                {"index": 127780},
                {"index": 129069},
                {"index": 129057},
                {"index": 129056},
                {"index": 129020},
                {"index": 128940},
                {"index": 128938},
                {"index": 62865},
                {"index": 129006},
                {"index": 128789},
                {"index": 128784},
                {"index": 128792},
                {"index": 128781},
                {"index": 128716},
                {"index": 128709},
                {"index": 128096},
                {"index": 128113},
                {"index": 128529},
                {"index": 128531},
                {"index": 128528},
                {"index": 128530},
                {"index": 128226},
                {"index": 128223},
                {"index": 62615},
                {"index": 128176},
                {"index": 128175},
                {"index": 128861},
                {"index": 128111},
                {"index": 62571},
                {"index": 127995},
                {"index": 127793},
                {"index": 127779},
                {"index": 128952},
                {"index": 128951},
                {"index": 128954},
                {"index": 128953},
                {"index": 128792},
                {"index": 128779},
                {"index": 129059},
                {"index": 128227},
                {"index": 128158},
                {"index": 129173},
                {"index": 129168},
                {"index": 129069},
                {"index": 62692},
                {"index": 128202},
                {"index": 129069},
                {"index": 128771},
                {"index": 128709},
                {"index": 127688},
                {"index": 128393},
                {"index": 129056},
                {"index": 128709},
                {"index": 128058},
                {"index": 128224},
                {"index": 62571},
                {"index": 129365},
                {"index": 129302},
                {"index": 128799},
                {"index": 62933},
                {"index": 127827},
                {"index": 127691},
                {"index": 62934},
                {"index": 128529},
                {"index": 62702},
                {"index": 128299},
                {"index": 62659},
                {"index": 127822},
                {"index": 128542},
                {"index": 128541},
                {"index": 128540},
                {"index": 62819},
                {"index": 128786},
                {"index": 128785},
                {"index": 62812},
                {"index": 128790},
                {"index": 62819},
                {"index": 128786},
                {"index": 128785},
                {"index": 62812},
                {"index": 127692},
                {"index": 127688},
                {"index": 62652},
                {"index": 128026},
                {"index": 62865},
                {"index": 128789},
                {"index": 128784},
                {"index": 128792},
                {"index": 128224},
                {"index": 129262},
                {"index": 129212},
                {"index": 129211},
                {"index": 129349},
                {"index": 128483},
                {"index": 128385},
                {"index": 127616},
                {"index": 128012},
                {"index": 62549},
                {"index": 128990},
                {"index": 128012},
                {"index": 62549},
                {"index": 128990},
                {"index": 128204},
                {"index": 128116},
                {"index": 129082},
                {"index": 129078},
                {"index": 128877},
                {"index": 127796},
                {"index": 129266},
                {"index": 129216},
                {"index": 128804},
                {"index": 128379},
                {"index": 128274},
                {"index": 127796},
                {"index": 129355},
                {"index": 128175},
                {"index": 129057},
                {"index": 128721},
                {"index": 128726},
                {"index": 128725},
                {"index": 128724},
                {"index": 128723},
                {"index": 127647},
                {"index": 128721},
                {"index": 128726},
                {"index": 128724},
                {"index": 128723},
                {"index": 127647},
                {"index": 62865},
                {"index": 128789},
                {"index": 128784},
                {"index": 128792},
                {"index": 128200},
                {"index": 63076},
                {"index": 128852},
                {"index": 129040},
                {"index": 128117},
                {"index": 128885},
                {"index": 128893},
                {"index": 62867},
                {"index": 62866},
                {"index": 62865},
                {"index": 128839},
                {"index": 128722},
                {"index": 128721},
                {"index": 62837},
                {"index": 128842},
                {"index": 128720},
                {"index": 128841},
                {"index": 128818},
                {"index": 128817},
                {"index": 128816},
                {"index": 128726},
                {"index": 128725},
                {"index": 128724},
                {"index": 128723},
                {"index": 128275},
                {"index": 128483},
                {"index": 128792},
                {"index": 128782},
                {"index": 128781},
                {"index": 128274},
                {"index": 128527},
                {"index": 128360},
                {"index": 128892},
                {"index": 128200},
                {"index": 62615},
                {"index": 128177},
                {"index": 128178},
                {"index": 128175},
                {"index": 127995},
                {"index": 127647},
                {"index": 127645},
                {"index": 128207},
                {"index": 127784},
                {"index": 62916},
                {"index": 128483},
                {"index": 128482},
                {"index": 62805},
                {"index": 128981},
                {"index": 128980},
                {"index": 128979},
                {"index": 128978},
                {"index": 127688},
                {"index": 129069},
                {"index": 128015},
                {"index": 128058},
                {"index": 128041},
                {"index": 62571},
                {"index": 127731},
                {"index": 127695},
                {"index": 129056},
                {"index": 128523},
                {"index": 128369},
                {"index": 128198},
                {"index": 127731},
                {"index": 62527},
                {"index": 128990},
                {"index": 129153},
                {"index": 129152},
                {"index": 129192},
                {"index": 129148},
                {"index": 129146},
                {"index": 129145},
                {"index": 129144},
                {"index": 129143},
                {"index": 129141},
                {"index": 129140},
                {"index": 129139},
                {"index": 129138},
                {"index": 129137},
                {"index": 129136},
                {"index": 62931},
                {"index": 129023},
                {"index": 128056},
                {"index": 128116},
                {"index": 129031},
                {"index": 129030},
                {"index": 129029},
                {"index": 129028},
                {"index": 129027},
                {"index": 129026},
                {"index": 62934},
                {"index": 128200},
                {"index": 62571},
                {"index": 127955},
                {"index": 128483},
                {"index": 62417},
                {"index": 128888},
                {"index": 128887},
                {"index": 128886},
                {"index": 128720},
                {"index": 128816},
                {"index": 128207},
                {"index": 128884},
                {"index": 127930},
                {"index": 127694},
                {"index": 129302},
                {"index": 129314},
                {"index": 129347},
                {"index": 63041},
                {"index": 129289},
                {"index": 129203},
                {"index": 129126},
                {"index": 128500},
                {"index": 128499},
                {"index": 128498},
                {"index": 128497},
                {"index": 128484},
                {"index": 62733},
                {"index": 127815},
                {"index": 127971},
                {"index": 127960},
                {"index": 62400},
                {"index": 128480},
                {"index": 127680},
                {"index": 127693},
                {"index": 127694},
                {"index": 63064},
                {"index": 129302},
                {"index": 63041},
                {"index": 129296},
                {"index": 129294},
                {"index": 129289},
                {"index": 127691},
                {"index": 128500},
                {"index": 128479},
                {"index": 128478},
                {"index": 128472},
                {"index": 128498},
                {"index": 128477},
                {"index": 128497},
                {"index": 128851},
                {"index": 128484},
                {"index": 129015},
                {"index": 128483},
                {"index": 128482},
                {"index": 62734},
                {"index": 128360},
                {"index": 128503},
                {"index": 127815},
                {"index": 128176},
                {"index": 127977},
                {"index": 127971},
                {"index": 127960},
                {"index": 62400},
                {"index": 128480},
                {"index": 127601},
                {"index": 128814},
                {"index": 129303},
                {"index": 127688},
                {"index": 127856},
                {"index": 128393},
                {"index": 62461},
                {"index": 129289},
                {"index": 129264},
                {"index": 129259},
                {"index": 128835},
                {"index": 128827},
                {"index": 128451},
                {"index": 129187},
                {"index": 62991},
                {"index": 62976},
                {"index": 129042},
                {"index": 129070},
                {"index": 128525},
                {"index": 129054},
                {"index": 129039},
                {"index": 129035},
                {"index": 128418},
                {"index": 128878},
                {"index": 128049},
                {"index": 128832},
                {"index": 128830},
                {"index": 128829},
                {"index": 128828},
                {"index": 128767},
                {"index": 128766},
                {"index": 128023},
                {"index": 62768},
                {"index": 128453},
                {"index": 128988},
                {"index": 62717},
                {"index": 128291},
                {"index": 128987},
                {"index": 128310},
                {"index": 128285},
                {"index": 128284},
                {"index": 62702},
                {"index": 128383},
                {"index": 128350},
                {"index": 128186},
                {"index": 128185},
                {"index": 128184},
                {"index": 128183},
                {"index": 127782},
                {"index": 128352},
                {"index": 62676},
                {"index": 62656},
                {"index": 128254},
                {"index": 128253},
                {"index": 62644},
                {"index": 62621},
                {"index": 128153},
                {"index": 128075},
                {"index": 128078},
                {"index": 127795},
                {"index": 127971},
                {"index": 127946},
                {"index": 62516},
                {"index": 127870},
                {"index": 127725},
                {"index": 62400},
                {"index": 128748},
                {"index": 62384},
                {"index": 127681},
                {"index": 127680},
                {"index": 62378},
                {"index": 128801},
                {"index": 129043},
                {"index": 128378},
                {"index": 127731},
                {"index": 62527},
                {"index": 62404},
                {"index": 129215},
                {"index": 129167},
                {"index": 129024},
                {"index": 129355},
                {"index": 127797},
                {"index": 128852},
                {"index": 129059},
                {"index": 128227},
                {"index": 128852},
                {"index": 128684},
                {"index": 128433},
                {"index": 62582},
                {"index": 129084},
                {"index": 127886},
                {"index": 129084},
                {"index": 128686},
                {"index": 62705},
                {"index": 62583},
                {"index": 128438},
                {"index": 128915},
                {"index": 128646},
                {"index": 62705},
                {"index": 128037},
                {"index": 128438},
                {"index": 128907},
                {"index": 128034},
                {"index": 128059},
                {"index": 62570},
                {"index": 128059},
                {"index": 62570},
                {"index": 128488},
                {"index": 128532},
                {"index": 128487},
                {"index": 128168},
                {"index": 128175},
                {"index": 129069},
                {"index": 62702},
                {"index": 128299},
                {"index": 62659},
                {"index": 127680},
                {"index": 128482},
                {"index": 62702},
                {"index": 128299},
                {"index": 129173},
                {"index": 129172},
                {"index": 129171},
                {"index": 129170},
                {"index": 129169},
                {"index": 129168},
                {"index": 62759},
                {"index": 128116},
                {"index": 128393},
                {"index": 128046},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128933},
                {"index": 128932},
                {"index": 128931},
                {"index": 128930},
                {"index": 129034},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128933},
                {"index": 128932},
                {"index": 128931},
                {"index": 128930},
                {"index": 129034},
                {"index": 129033},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 128154},
                {"index": 127687},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128933},
                {"index": 128932},
                {"index": 128931},
                {"index": 128930},
                {"index": 129034},
                {"index": 129033},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127854},
                {"index": 127792},
                {"index": 128929},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128933},
                {"index": 128932},
                {"index": 128931},
                {"index": 128930},
                {"index": 129034},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128931},
                {"index": 129034},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128931},
                {"index": 129034},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 129194},
                {"index": 129193},
                {"index": 129353},
                {"index": 128315},
                {"index": 128937},
                {"index": 128934},
                {"index": 128931},
                {"index": 129034},
                {"index": 128163},
                {"index": 127899},
                {"index": 128936},
                {"index": 127792},
                {"index": 128929},
                {"index": 62697},
                {"index": 129266},
                {"index": 127921},
                {"index": 62467},
                {"index": 128117},
                {"index": 128804},
                {"index": 128604},
                {"index": 128715},
                {"index": 62768},
                {"index": 128602},
                {"index": 128599},
                {"index": 128209},
                {"index": 128470},
                {"index": 127858},
                {"index": 127688},
                {"index": 128224},
                {"index": 127958},
                {"index": 128170},
                {"index": 128176},
                {"index": 128003},
                {"index": 128071},
                {"index": 128008},
                {"index": 127810},
                {"index": 127649},
                {"index": 129331},
                {"index": 129321},
                {"index": 129311},
                {"index": 129248},
                {"index": 129247},
                {"index": 129070},
            ],
        },
        {
            "question": "What genes play role in ovarian cancer?",
            "expected_answer": "The genes that play a role in ovarian cancer include fam107a, mre11, dph1, slc22a10, gpr150, kansl1, arl11, muc16, chmp4c, lrrc46, macir, brip1, c19orf12, plekhf1, wdr77, trmt11, prtfdc1, lrrc59, rnf43, haus6, bnc2, cdk12, desi2, babam1, tiparp, spdef, sulf1, jmjd6, rras2, pop4, srsf10, camkk2, atg7, yap1, dlc1, tubb3, msln, hdac6, atg5, dyrk1b, prc1, selenbp1, tnfsf10, uri1, skap1, tp63, itga8, bap1, wnt7a, and tyms.",
            "expected_cypher": 'MATCH (d:disease {name: "neoplasms, ovarian"})-[:associated_with]->(g:gene_or_protein) RETURN g.name',
            "nodes": [
                {"index": 13181},
                {"index": 3866},
                {"index": 3409},
                {"index": 78},
                {"index": 1785},
                {"index": 6739},
                {"index": 11193},
                {"index": 8167},
                {"index": 5268},
                {"index": 6504},
                {"index": 5794},
                {"index": 207},
                {"index": 8192},
                {"index": 1650},
                {"index": 1012},
                {"index": 9889},
                {"index": 3980},
                {"index": 452},
                {"index": 2604},
            ],
        },
        {
            "question": "Which medications are currently available for treating Parkinson's disease?",
            "expected_answer": "The medications currently available for treating Parkinson's disease include benzatropine, apomorphine, levodopa, istradefylline, entacapone, amantadine, droxidopa, safinamide, biperiden, selegiline, orphenadrine, rotigotine, ropinirole, rasagiline, pergolide, bromocriptine, tolcapone, opicapone, trihexyphenidyl, procyclidine, cycrimine, pramipexole, pimavanserin, piribedil, carbidopa, metixene, and melevodopa. These medications help manage the symptoms and improve the quality of life for individuals with Parkinson's disease.",
            "expected_cypher": 'MATCH (d:disease {name: "parkinson disease"})-[:indication]->(drug:drug) RETURN drug.name',
            "nodes": [
                {"index": 14139},
                {"index": 14220},
                {"index": 14321},
                {"index": 14452},
                {"index": 14806},
                {"index": 14830},
                {"index": 14831},
                {"index": 14904},
                {"index": 15124},
                {"index": 15138},
                {"index": 15147},
                {"index": 15193},
                {"index": 15291},
                {"index": 15333},
                {"index": 15490},
                {"index": 15493},
                {"index": 15772},
                {"index": 15812},
                {"index": 16054},
                {"index": 16056},
                {"index": 16315},
                {"index": 16842},
                {"index": 17270},
                {"index": 17414},
                {"index": 19207},
                {"index": 20153},
                {"index": 20591},
            ],
        },
        {
            "question": "What are the likely causes of chronic kidney disease?",
            "expected_answer": "The likely causes of chronic kidney disease include exposure to cadmium and particulate matter.",
            "expected_cypher": 'MATCH (disease:disease {name: "kidney failure, chronic"})-[:linked_to]->(exposure:exposure) RETURN exposure.name',
            "nodes": [{"index": 61717}, {"index": 61785}],
        },
        {
            "question": "What are symptoms of rheumatoid arthritis?",
            "expected_answer": "Symptoms of rheumatoid arthritis include vasculitis, a positive rheumatoid factor, weight loss, fever, interphalangeal joint erosions, positivity for anti-citrullinated protein antibodies, arthralgia, swan neck-like deformities of the fingers, digital flexor tenosynovitis, elevated C-reactive protein levels, fatigue, joint stiffness, polyarticular arthritis, elevated erythrocyte sedimentation rate, and joint swelling. These symptoms collectively contribute to the clinical diagnosis and management of the condition.",
            "expected_cypher": 'MATCH (d:disease {name: "rheumatoid arthritis"})-[:phenotype_present]->(p:effect_or_phenotype) RETURN p.name',
            "nodes": [
                {"index": 23956},
                {"index": 85299},
                {"index": 23736},
                {"index": 22952},
                {"index": 86562},
                {"index": 92247},
                {"index": 23901},
                {"index": 86513},
                {"index": 89234},
                {"index": 88592},
                {"index": 25620},
                {"index": 24045},
                {"index": 23937},
                {"index": 86388},
                {"index": 85550},
                {"index": 84874},
            ],
        },
        {
            "question": "Which biomarkers are associated with a diagnosis of Alport syndrome?",
            "expected_answer": "The biomarkers associated with a diagnosis of Alport syndrome include the genes COL4A3, COL4A4, and COL4A5. These genes are crucial for understanding the genetic basis of the condition.",
            "expected_cypher": 'MATCH (d:disease {name: "nephritis, hereditary"})-[:associated_with]->(g:gene_or_protein) RETURN g.name',
            "nodes": [
                {"index": 2132},
                {"index": 11428},
                {"index": 909},
                {"index": 11545},
                {"index": 209},
                {"index": 8571},
            ],
        },
        {
            "question": "How many biomarkers are associated with a diagnosis of Alport syndrome?",
            "expected_answer": "There are 6 biomarkers associated with the diagnosis of Alport syndrome.",
            "expected_cypher": 'MATCH (d:disease {name: "nephritis, hereditary"})-[:associated_with]->(gp:gene_or_protein) RETURN COUNT(gp)',
            "nodes": [
                {"index": 2132},
                {"index": 11428},
                {"index": 909},
                {"index": 11545},
                {"index": 209},
                {"index": 8571},
            ],
        },
    ]

    eval_sample_addition = EvalSampleAddition(
        graph=build_neo4j_graph(),
        subgraph_extractor=LLMSubGraphExtractor(
            model=load_chat_model(),
        ),
        path_to_json=Path("src/fact_finder/evaluator/evaluation_samples.json"),
    )

    for sample in manual_samples:

        eval_sample_addition.add_to_evaluation_sample_json(
            question=sample["question"],
            expected_cypher=sample["expected_cypher"],
            source="manual",
            expected_answer=sample["expected_answer"],
            is_answerable=True,
            nodes=sample["nodes"],
        )
